app/views/articles/_article.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = ?  [["article_id", 1]]
---
  <ul class="tags">
    <% article.tags.each do |tag|%>