app/views/shared/_user_thumb.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---

<% if comment.user.image.exists?%>