app/controllers/articles_controller.rb

  def index
    @articles=Article.all
    @tags=Tag.all
---
SELECT "articles".* FROM "articles"
SELECT "tags".* FROM "tags"

  def create
    @article =Article.new(articleParam)
    @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "wow ana shifit"], ["text", "omg yes you are"], ["created_at", "2017-12-25 16:59:05.748313"], ["updated_at", "2017-12-25 16:59:05.748313"]]

  def update
    @article=Article.find(params[:id])
    @article.update(articleParam)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "marijuana-1556358_1920.jpg"], ["image_updated_at", "2018-01-04 11:22:10.345030"], ["updated_at", "2018-01-04 11:22:10.989997"], ["id", 3]]

  def destroy
    @article=Article.find(params[:id])
    @article.destroy()
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]