app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "article_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "klsd;ljsd"], ["article_id", 1], ["created_at", "2018-03-08 20:31:26.976346"], ["updated_at", "2018-03-08 20:31:26.976346"], ["user_id", "2"]]
---
  def create
    @comment=Comment.new(comment_params)
    @comment.article_id=params[:article_id]
    @comment.user_id=current_user.id
    if !@comment.save