app/controllers/messages_controller.rb

  def new
    @message=Message.new()
    @message.reciever=User.find_by(id:params[:id]) || User.find_by(email:'samirsuraj@live.com')
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "samirsuraj@live.com"], ["LIMIT", 1]]

  def create
    sender= current_user || @default_user
    @message = sender.sent_messages.build(message_params)
    if @message.save
---
INSERT INTO "messages" ("sender_id", "reciever_id", "topic", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)